Gregification/BeeMS/VT_MSPM0G3507_A/src/Core/system.cpp
bool System::I2C::I2C::tx_blocking(uint8_t addr, void const * data, uint8_t size, TickType_t timeout){
    TickType_t starttime = xTaskGetTickCount();

    uint8_t const * arr = (uint8_t const *)data;

    DL_I2C_flushControllerTXFIFO(reg);

    size -= DL_I2C_fillControllerTXFIFO(reg, arr, size);

    while (!(DL_I2C_getControllerStatus(reg) & DL_I2C_CONTROLLER_STATUS_IDLE))
        {}

    DL_I2C_startControllerTransfer(
            reg,
            addr,
            DL_I2C_CONTROLLER_DIRECTION::DL_I2C_CONTROLLER_DIRECTION_TX,
            size
        );

    TickType_t elapsedtime;

    while(size > 0){
        size -= DL_I2C_fillControllerTXFIFO(reg, arr, size);

        elapsedtime = xTaskGetTickCount() - starttime;

        if(
                (
                    DL_I2C_getControllerStatus(reg) & (
                    DL_I2C_CONTROLLER_STATUS_IDLE
                    | DL_I2C_CONTROLLER_STATUS_ERROR  )
                )
            || (elapsedtime >= timeout)
            )
            break;
    }

    while (DL_I2C_getControllerStatus(reg) &
               DL_I2C_CONTROLLER_STATUS_BUSY_BUS)
            ;

    return size && (elapsedtime < timeout);
}

bool System::I2C::I2C::rx_blocking(uint8_t addr, void * data, uint8_t size, TickType_t timeout){
    TickType_t starttime = xTaskGetTickCount();

    while (!(DL_I2C_getControllerStatus(reg) & DL_I2C_CONTROLLER_STATUS_IDLE))
            {}

    DL_I2C_flushControllerTXFIFO(reg);

    DL_I2C_startControllerTransfer(
                reg,
                addr,
                DL_I2C_CONTROLLER_DIRECTION::DL_I2C_CONTROLLER_DIRECTION_RX,
                size
            );

    TickType_t elapsedtime;

    for(uint8_t i = 0; i < size; i++){
        while(DL_I2C_isControllerRXFIFOEmpty(reg)){
            elapsedtime = xTaskGetTickCount() - starttime;

            if((DL_I2C_getControllerStatus(reg) & DL_I2C_CONTROLLER_STATUS_ERROR)
                    || (elapsedtime >= timeout))
                break;

        }
        ((uint8_t *)data)[i] = DL_I2C_receiveControllerData(reg);
    }

    return size && (elapsedtime < timeout);
}

/*--- Peripheral IRQ assignment --------------------------------------------------------*/
/* most peripherals don't need a IRQ
 */

#ifdef PROJECT_ENABLE_I2C0
    void I2C0_IRQHandler(void){ System::i2c0._irq(); }
#endif
#ifdef PROJECT_ENABLE_I2C1
//    void I2C1_IRQHandler(void){ System::i2c1._irq(); }
#endif

/*--- idiot detection ------------------------------------------------------------------*/

#if !defined(PROJECT_ENABLE_UART0)
    #error "uart0 should always be enabled and used for the UI. better be a good reason otherwise."
    /* uart0 is used by the LP */
#endif
